int A[100];
int B[5],C[6];
double F1[8];
char S1[12],S2[23];
#define N 20
/**
 * [一维数组]
 * 元素类型、数组名和长度组成的构造类型。
 * 数组长度在定义时已经确定，用常量表达式表示
 * 
 * [一维数组内存形式]
 * 数组元素是连续存放的，
 * 内存中一个“很大的变量”，简称“块”
 * 索引元素是通过数组名加相对偏移量而来 A[n],数组A中偏移量n-1的元素
 *
 * [数组对象初始化]
 * 元素类型 数组名[常量表达式]={初值列表},......;
 * 
 * int A[5]={1,2,3},总共5个，只给出3个，后两位默认为0
 * 
 * [计算数组int A[n]的长度]
 * sizeof A/sizeof(int)//数组内存长度/元素内存长度=数组长度
 * 
 * 数组未初始化，函数体外静态数组元素默认0，函数体内动态数组元素为随机值
 * 
 * "[]":下标运算符
 * 
 * 只能对数组元素赋值，不能对整个数组赋值
*/
#include <stdio.h>
int main()
{
    int i,j;
    int a[10]={4,2,7,1,9,10,3,5,2,8};
    for(i=1;i<10;i++){
        for(j=1;j<=a[i-1];j++)
            printf("*");
        printf("\n");
    }
    return 0;
}
/**
 * [多维数组]
 * int a[2][3];
 * 左边为高维，右边为低维
 * 多维数组是一个集合，包含多个元素，每个元素又是一个n-1维数组
 * 
 * 若A是二维数组，则A[0]/A[1]/A[2]是元素，也是一个一维数组
 * 一维数组A[0],则A[0][0],A[0][1]是一维数组的元素
 * 
 * [多维数组内存形式]
 * 无论多少维，都是转化成一维数组
 * int a[3][4][5];
 * 实际上
 * int a[60];//3*4*5
 * 则元素：
 * a[i][j][k]
 * 实际上
 * a[i*4*5+j*5+k]
 * 
 * [初始化多维数组]第一维通常被视为低维。具体来说，第一维是最外层的维度，表示最粗粒度的层级，而后续的维度表示更细粒度的层级。
 * 在C和C++中，多维数组是按照行优先的顺序存储的，
 * 第一维在左边。例如，声明一个二维数组 int array[3][4];，
 * 其中 array 有3行4列，第一维表示行数，第二维表示列数。
 * int A[2][3]={{1,2,3},{4,5,6}};//两行三列
 * 
 * int A[3][4]={1,2,3,4,5};//直接按一维数组给值，先满4，第5给二维
 * 
 * int[][2][3] ={1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}, / /正确
 * int B[2][][3] ={1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}, / /错误,只能省略高维
 * int C[2][2][] ={1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}, / /错误,只能省略高维
 * 
 * 求数组长度
 * sizeof A/(sizeof(int)*2*3)
 * 
*/
/**
 * [遍历数组元素]
 * 一维数组
 * 
 * 
*/
#include <stdio.h>
int main()
{
    int i,A[100];
    for(i=0;i<100;i++)
        scanf("%d",&A[i]);
    for(i=100-1;i>=0;i--)
        printf("%d ",A[i]);
    return 0;
}
/**
 * [二维数组遍历]
 * for嵌套
 * 
 * 
*/
int main()
{
    int A[3][4],i,j;
    for(i=0;i<3;i++)
        for(j=0;j<4;j++)
            scanf("%d",&A[i][j]);
    for(i=0;i<3;i++)
        for(j=0;j<4;j++)
            printf("%d",&A[i][j]);
        printf("\n");
}
/**
 * [数组复制]
 * 
 * A[i]=B[i];
 * 
*/
/**
 * [数组与枚举]
 * 数码管高亮   hh:mm 时：分
 * 0<=hh<=24,0<=mm<=60;
 * 
 * 
*/
#include <stdio.h>
int s[] = {6,2,5,5,4,5,6,3,7,6}; 
int main ()
{
    int hh,mm,n,flag;
    while (scanf("%d", &n)!=EOF) {//直到没有读取到有输入值
        flag=0;
        for (hh = 0;hh<24 && flag==0;hh++)
            for (mm = 0;mm<60 && flag==0;mm++)
                if (s[hh%10]+s[hh/10]+s[mm%10]+s[mm/10]==n) {
                    printf ("%02d:%02d\n", hh, mm); 
                    flag=1;
                }
                if (flag==0)
                    printf ("Impossible\n"); 
    }
}

/**
 * [大量输入时两种方法]
 * 1.将100个数保存到记事本文件中，复制到输入栏
 * 2.freopen("in.txt","r",stdin);
 * for(i=0;i<100;i++)
 *  scanf("%d",&A[i]);
 * 
*/
