/**
 * [输入输出]
 * C语言输入输出通过函数实现
 * 字符输出：putchar
 * 字符输入：getchar
 * 格式输出：printf
 * 格式输入：scanf
 * #include <stdio.h>
 * 
*/
/**
 * [putchar]向显示终端输出一个字符
 * putchar(c)；
 * c为整型，低八位的值，输出对应的ASCII符号。c可以是常量、变量、表达式
 * 可以是整型数据、字符型数据或转义字符
 * 
*/
/**
 * [getchar]返回输入的字符
 * 输入操作步骤：
 * 1.检查输入缓冲区是否有字符
 * 2.缓冲区有字符，就提取，指针指向下一个字符
 * 3.如果没有字符就等待键盘输入，光标闪烁，等待输入并回车才结束
 *    
*/
/**
 * [printf]格式输出
 * printf(格式控制，输出项列表);
 * printf("%d,%f\n",a,b)
 * 输出项列表与格式说明一一对应。
 * 
 * [格式说明域]
 * %[flags][width][.prec][h|l|L|F|N]type
 * 标志、宽度、精度、类型，中括号代表可选
 * 
 * type:必需，决定输出项转为字符、字符串还是数值，d:带符号十进制整数，u:无符号十进制整数，
 * o:无符号八进制，x:无符号十六进制，f:浮点数~ %0.2f,e/E:指数，g/G:智能选择e或者f
 * c:char 单个字符，s:字符串指针，直到第一个非空字符('\0')或满足精度的字符串
 * %d
 * %f
 * %s
 * %c
 * 
 * flags:可选，标志，控制对齐、符号、空格及八进制前缀
 * width:可选，宽度，最小显式宽度
 * .prec:可选，精度，浮点数小数精度
 * h|l|L|F|N：大小修饰，输出项类型大小，指针远近
 * 
 * 类型不对应，输出结果就不确定
 * float a=1.23;
 * int b=12;
 * printf("%d,%lf\n",a,b);
*/
/**
 * [printf标志字符]
 * -        左对齐输出结果，右边空格填充
 * +        输出有符号数，负数有-号
 * 空格     +的补充
 * 
*/
/**
 * [格式化输入]
 * scanf("%d%d",&a,&b);//加上&
 * 格式控制：
 * 1.空白符：空格、\t、\n,用来匹配两个数间隔，输入其他就是错的
 * 2.在末尾加\n，输入的空格符会被吃掉
 * 3.
 * 
*/
/**
 * scanf格式说明域,比printf少，但大多数相同
 * %d
 * %o
 * %X
 * %u
 * %c
 * %s
 * 
 * [只读不存]用来跳过 *号
 * int a,b,c;
 * scanf("%1d%*2d%3d",&a,&b);
 * 输入：123456789；结果：a=1,b=456
*/
void main()
{
    char a='C',b=6,c=0;
    putchar(a);         //输出C
    putchar(b+'0');     //整型表达式，输出6
    putchar('\110');    //转义字符（八进制），输出H
    putchar('\n');      //执行换行

    getchar();          //停下来等待调试输入

    printf("%d,%d,%d\n",a,b,c); //输出项与格式说明个数相等
    printf("%d,%d\n",a,b,c);    //输出项多于格式说明个数，c忽略
    printf("%d,%d,%d\n",a,b);   //输出项少于格式说明个数，第三个输出不可预料

    int a=123,b=-1;
    //①输出整型数据
    printf("%d,%u,%x,%x,%o\n",a,a,a,a,a);
    //十进制、无符号、十六进制和八进制
    //输出结果：123,123,7b,7B,173
    printf("%d,%u,%x,%X,%o\n",b,b,b,b,b);
    //十进制、无符号、十六进制和八进制,负数为补码
    //输出结果：-1,4294967295,ffffffff,FFFFFFFF,37777777777

    int a=123; double y=12;
    //②输出带格式的整型数据
    printf("[%+d],[%+d],[% d],[% d]\n",a,-a,a,-a);
    //填充正负符号、填充空格
    //输出结果：[+123]，[-123],[ 123],[-123]
    //⑦输出带格式的浮点型数据
    printf("[%+lf],[%+lf],[% lf],[% lf]\n",y,-y,y,-y);
    //填充正负符号、填充空格
    //输出结果: [+12.000000],[-12.000000],[ 12.000000],[-12.0000
    
    int a=123;
    printf("%#d,%#x,%#X,%#o\n",a,a,a,a);
    //填充十六进制、八进制前缀
    //输出结果：123,0x7b,0x7B,0173

    int a=123,b=-1,c=12345;
    //②输出带格式的整型数据
    printf("[%d],[%4d],[%-4d],[%4d], [%-4d]\n",a,a,a,c,c);
    //宽度、右对齐、左对齐、实际宽度
    //输出结果: [123],[ 123],[123 ],[12345],[12345]
    printf("[%04d],[%04d],[%04d],[%-04d]\n",a,b,c,a);
    //左边填充0、右边不影响
    //输出结果：[0123],[-001],[12345],[123]

    //输出字符串string的首字母
    printf("[%s],[%6s]","Java","Java");
    //输出结果：[Java],[  Java]

    //*输出长度自定义
    int a=123;
    printf("[%*d]",5,a);//这里的5代表*的长度值

    double x=12.3456,y=12;
    printf("[%lf],[%10lf],[%10.2lf],[%.2lf]\n",x,x,x,x);
    //输出结果：[12.345600],[ 12.345600],[     12.35],[12.35]

    printf("Please input a=");
    scanf("%d",&a);

    int a;long h;short i;double x,y;
    scanf("%d%ld%hd%lf%le",&a,&h,&i,&x,&y);//输入整型、长整型、短整型、浮点型
    //输入1 2 3 1.23 3.25 结果：与输入一致
    //输入：1 -1 32768 12.3 12e5  结果：1,-1,-32768,12.3,1.2e6
}